app/controllers/players_controller.rb

INSERT INTO "players" ("name", "img", "position", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["img", "https://i.imgur.com/Ur1MoDf.png"], ["position", "forward"], ["user_id", 1], ["created_at", "2020-12-02 20:07:24.108761"], ["updated_at", "2020-12-02 20:07:24.108761"]]
---
  def create
    @player = Player.new(player_params)
    @player.user = @current_user

    if @player.save

UPDATE "players" SET "img" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["img", "https://i.imgur.com/Ra1JITz.png"], ["updated_at", "2020-12-05 21:18:36.599229"], ["id", 2]]
---
  def update
    if @player.update(player_params)

DELETE FROM "players" WHERE "players"."id" = $1  [["id", 3]]
---
  def destroy
    @player.destroy

SELECT "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def add_skill
    @skill = Skill.find(params[:skill_id])

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_player
      @player = Player.find(params[:id])

SELECT "players".* FROM "players" WHERE "players"."user_id" = $1 AND "players"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
    def set_user_player
      @player = @current_user.players.find(params[:id])